In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as stats

from sqlalchemy import create_engine
from config import Password, Username
engine = create_engine(f'postgresql://{Username}:{Password}@localhost/sql-challenge')
connection = engine.connect()

In [13]:
employees_data = pd.read_sql("SELECT * FROM employees", connection)
salary_data = pd.read_sql("SELECT * FROM salaries", connection)
title_data = pd.read_sql("SELECT * FROM titles", connection)

In [14]:
title_data

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager